// Задача  10.

Console.WriteLine("Введите трёхзначное число");
int threeDigitNumber = Convert.ToInt32(Console.ReadLine());
string stringNumber = Convert.ToString (threeDigitNumber);
{
Console.WriteLine ("вторая цифра введённого числа " + stringNumber[1]);
}