// Задача  10.

Console.WriteLine("Введите трёхзначное число");
int Number = Convert.ToInt32(Console.ReadLine());
string stringNumber = Convert.ToString (Number);
{
Console.WriteLine ("вторая цифра введённого числа " + stringNumber[1]);
}